app/controllers/posts_controller.rb

  def index
      if params.has_key?(:user_id)
        render json: Post.find_all_by_user_id(params[:user_id])
      elsif params.has_key?(:num_posts_for_user)
        render json: Post.where(user_id: params[:num_posts_for_user]).count
      else
        render json: Post.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
SELECT "posts".* FROM "posts"

  def show
    render json: Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "index"]]